{
    "events": [
      {
        "id": "event_neighbor_grandma",
        "type": "choice",
        "weight": 8,
        "mainVideo": "event1_main.mp4",
        "title": "Стукіт у двері",
        "shortDescription": "Здається, до вас завітала ваша улюблена сусідка...",
        "fullDescription": "Стук у двері. “Хто це мене хоче о такій годині!?” - розлючений студент підходить до входу у квартиру. З кожним його кроком стукіт ніби пришвидшувався та ставав гучнішим. “Та йду вже, досить!” - кричить він, але стукіт ставав сильнішим. Ось вже Денис дивиться в глазок і бачить як старенька бабуся, з силою ніби в неї вселився демон, стучить до нього. Ще трохи і двері почнуть виходити з петель.",
        "choices": [
          {
            "buttonText": "Відчинити двері",
            "outcome": {
              "duration": 6000,
              "video": "event1_1.mp4",
              "sound": "event1_1.mp3",
              "effects": [
                { "type": "modify_time", "value": -10 }
              ],
              "epilogueTexts": [
                "Завдяки вашій хоробрості, ви тепер офіційно ворог №1 для всіх бабусь району.",
                "Цей інцидент надихнув вас на написання трилера 'Бабця з першого поверху'. Книга стала бестселером.",
                "Ви встановили нові, міцніші двері. Про всяк випадок.",
                "З'ясувалося, що Мурзік просто спав у неї в шафі.",
                "Після цього випадку ви почали носити з собою ковбасу для самозахисту."
              ]
            }
          },
          {
            "buttonText": "Працювати далі",
            "outcome": {
              "duration": 8000,
              "video": "event1_2.mp4",
              "sound": "event1_2.mp3",
              "effects": [
                { "type": "modify_progress_rate", "value": 0.5, "duration": 20000 }
              ],
              "epilogueTexts": [
                "Тепер ви здригаєтеся від кожного стуку, а запах ковбаси викликає у вас панічні атаки.",
                "Ви подали в суд на бабусю і відсудили у неї річний запас солі та Мурзіка.",
                "Ви написали скаргу в ЖЕК, але там лише розвели руками і порадили 'бути добрішим до старших'.",
                "Наступного дня ви знайшли під дверима записку: 'Я знаю, де ти живеш'.",
                "Ця історія стала легендою вашого будинку."
              ]
            }
          }
        ]
      },
      {
        "id": "event_father_call",
        "type": "choice",
        "weight": 5,
        "mainVideo": "event2_main.mp4",
        "title": "Дзвінок батька",
        "shortDescription": "Неочікуваний дзвінок... Невже щось трапилось?",
        "fullDescription": "На екрані ноутбука дзвінок. Такий неочікуваний посеред ночі. Дзвінок був від батька. «Невже щось трапилось?» - зі страхом подумав студент. Він прийняв виклик.\n«Привіт, синку. Я маю дещо тобі сказати, що приховував усе твоє життя. Ти прийомний» - сказав з утомленим, але серйозним та чітким голосом батько. У студента потемніло в очах.",
        "choices": [
          {
            "buttonText": "Пожартувати",
            "outcome": {
              "duration": 5000,
              "video": "event2_1.mp4",
              "sound": "event2_1.mp3",
              "effects": [
                { "type": "modify_progress_rate", "value": 0.75, "duration": 20000 }
              ],
              "epilogueTexts": [
                "Ваш чорний гумор допоміг вам пережити цей вечір, але терапевту довелося працювати втричі більше.",
                "Наступного дня батько зізнався, що це був невдалий пранк. Ви досі з ним не розмовляєте.",
                "Ви використали цю історію як сюжет для стендап-виступу і прославилися.",
                "Ви почали досліджувати своє коріння і з'ясували, що ви далекий нащадок індійського магараджі.",
                "Жарт виявився настільки вдалим, що батько почав сумніватися, чи не його часом всиновили."
              ]
            }
          },
          {
            "buttonText": "Накричати",
            "outcome": {
              "duration": 4000,
              "video": "event2_2.mp4",
              "sound": "event2_2.mp3",
              "effects": [
                { "type": "disable_work", "duration": 10000 }
              ],
              "epilogueTexts": [
                "Ставши професійним розробником, ви створили найскладнішу CAPTCHA у світі, яку міг пройти лише справжній індус.",
                "Ви поїхали до Індії, знайшли своїх біологічних батьків і дізналися, що вони продали вас за корову.",
                "Ваш крик розбудив сусідів, і вам довелося пояснювати поліції, чому ви кричите про Індію о другій ночі.",
                "Ви змінили своє ім'я на Раджеш і почали говорити з акцентом.",
                "Батько, щоб загладити провину, купив вам новий комп'ютер. Ви його пробачили."
              ]
            }
          }
        ]
      },
      {
        "id": "event_laptop_battery",
        "type": "qte",
        "weight": 10,
        "mainVideo": "event3_main.mp4",
        "loopVideo": "event3_loop.mp4",
        "title": "Розрядився ноут!",
        "shortDescription": "5%... 4%... Треба терміново знайти зарядку!",
        "fullDescription": "На екрані ноутбука повідомлення, що залишилось 5% зарядки. І одразу змінюється на 4%. “О Боже, в мене ж зараз весь проєкт полетить!” - панікує студент та шукає зарядний пристрій. Він заплутується в кабелях та падає, а зарядки все ще не видно, а нога застрягла в кабелях.",
        "qteSettings": {
          "duration": 8000,
          "clicksToWin": 25
        },
        "successOutcome": {
          "duration": 4000,
          "video": "event3_success.mp4",
          "sound": "event3_success.mp3",
          "effects": [],
          "epilogueTexts": [
            "Ви розвинули настільки швидку реакцію, що тепер можете ловити мух паличками для їжі.",
            "Після цього випадку ви купили павербанк для ноутбука. І для павербанка.",
            "Цей досвід навчив вас тримати всі кабелі в ідеальному порядку.",
            "Ви встигли зберегти проєкт на 1%, що стало легендою серед ваших друзів.",
            "На радощах ви випадково видалили проєкт, але швидко відновили його з кошика."
          ]
        },
        "failureOutcome": {
          "duration": 6000,
          "video": "event3_failure.mp4",
          "sound": "event3_failure.mp3",
          "effects": [
            { "type": "modify_time", "value": -10 },
            { "type": "modify_progress", "value": -10 }
          ],
          "epilogueTexts": [
            "Ви втратили частину роботи, але знайшли в собі сили почати все заново. Це загартувало ваш характер.",
            "Ви звинуватили у всьому виробника ноутбука і написали гнівний відгук на 10 сторінок.",
            "Наступного дня ви дізналися, що автозбереження було ввімкнене. Ви відчули себе дурнем.",
            "Ви так розлютилися, що викинули ноутбук у вікно. Довелося купувати новий.",
            "Ви зрозуміли, що життя занадто коротке, щоб турбуватися про втрачені файли. І пішли спати."
          ]
        }
      },
      {
        "id": "event_startup_idea",
        "type": "choice",
        "weight": 6,
        "mainVideo": "event4_main.mp4",
        "title": "Геніальна ідея!",
        "shortDescription": "Вас осяяло! Це ідея на мільйон... але не для цього проєкту.",
        "fullDescription": "Під час написання коду вас раптово осяює. Це не просто ідея, це ГЕНІАЛЬНА ІДЕЯ для стартапу! \"Додаток для спілкування з рослинами за допомогою азбуки Морзе!\". Мозок вимагає негайно записати цей план, поки він не зник.",
        "choices": [
          {
            "buttonText": "Записати ідею",
            "outcome": {
              "duration": 5000,
              "video": "event4_1.mp4",
              "sound": "event4_1.mp3",
              "effects": [
                { "type": "modify_time", "value": -20 }
              ],
              "epilogueTexts": [
                "Ваш стартап 'PlantTalk' провалився, але ви навчилися розмовляти зі своїм фікусом.",
                "Ви продали ідею Google за мільйон доларів і кинули навчання.",
                "Записуючи ідею, ви випадково написали ідеальний код для свого поточного завдання.",
                "Ви так захопилися, що забули про дедлайн, але ваш бізнес-план отримав нагороду.",
                "Виявилося, що такий додаток вже існує. Ви були спустошені."
              ]
            }
          },
          {
            "buttonText": "Ігнорувати",
            "outcome": {
              "duration": 3000,
              "video": "event4_2.mp4",
              "sound": "event4_2.mp3",
              "effects": [
                { "type": "disable_work", "duration": 15000 }
              ],
              "epilogueTexts": [
                "Ви успішно здали проєкт, але до кінця життя вас мучило питання: 'А що, якби?..'",
                "Ідея виявилася не такою вже й геніальною, коли ви про неї згадали наступного ранку.",
                "Намагаючись ігнорувати ідею, ви увійшли в стан потоку і завершили роботу вдвічі швидше.",
                "Ви розповіли ідею другу, він її реалізував і став мільйонером. Ви досі шкодуєте.",
                "Ви зосередилися на роботі, довівши, що сила волі сильніша за будь-які стартапи."
              ]
            }
          }
        ]
      },
      {
        "id": "event_friend_help",
        "type": "choice",
        "weight": 9,
        "mainVideo": "event5_main.mp4",
        "title": "Друг просить допомоги",
        "shortDescription": "Найкращий друг спамить повідомленнями. Це точно щось термінове!",
        "fullDescription": "Денис працює над кодом та сфокусувався для хардкодінгу, як раптом сповіщення з телефону. Він одразу виходить з колії та думає “Що ж це там?”. Денис бачить сповіщення від його найкращого друга, де він просить терміново допомогти йому. Деталі він не написав. Чи витрачати на це час?",
        "choices": [
          {
            "buttonText": "Відповісти",
            "outcome": {
              "duration": 7000,
              "video": "event5_1.mp4",
              "sound": "event5_1.mp3",
              "effects": [
                { "type": "modify_time", "value": -20 }
              ],
              "epilogueTexts": [
                "Ви заблокували друга, але він створив новий акаунт, щоб запитати, за що ви його заблокували.",
                "Ви допомогли йому згадати назву аніме. На знак подяки він замовив вам піцу.",
                "Цей випадок навчив вас ставити телефон в режим 'не турбувати' під час роботи.",
                "Ви витратили час, але зберегли дружбу. Хоча іноді сумніваєтесь, чи воно того варте.",
                "Виявилося, що друг просто хотів дізнатися ваше домашнє завдання."
              ]
            }
          },
          {
            "buttonText": "Ігнорувати",
            "outcome": {
              "duration": 5000,
              "video": "event5_2.mp4",
              "sound": "event5_2.mp3",
              "effects": [
                { "type": "modify_progress_rate", "value": 0.75, "duration": 15000 }
              ],
              "epilogueTexts": [
                "Друг образився на вас, але ви здали проєкт. Іноді доводиться робити важкий вибір.",
                "Вимкнувши звук, ви відчули такий спокій, що ваша продуктивність злетіла до небес.",
                "Наступного дня ви дізналися, що у друга була справжня проблема, і тепер відчуваєте себе винним.",
                "Ви ігнорували його так довго, що він подумав, що з вами щось трапилося, і викликав поліцію.",
                "Ваша здатність до концентрації вразила навіть вас самих."
              ]
            }
          }
        ]
      },
      {
        "id": "event_mandarin_craving",
        "type": "choice",
        "weight": 3,
        "mainVideo": "event6_main.mp4",
        "title": "Хочеш мандаринку?",
        "shortDescription": "Раптове, непереборне бажання... Вам потрібна мандаринка. Негайно.",
        "fullDescription": "Денис зосереджено пише код. Але раптом його живіт починає видавати звуки голоду. І студент розуміє, що різко дуже захотів мандаринку. Це просто негайна потреба - з’їсти смачненький цитрус. Він не може ні про що думати, окрім мандаринки. Денис підіймає погляд вище свого екрану ноутбука та йому мерещиться мандаринка.",
        "choices": [
          {
            "buttonText": "Ловити мандаринку",
            "outcome": {
              "duration": 8000,
              "video": "event6_1.mp4",
              "sound": "event6_1.mp3",
              "effects": [
                { "type": "modify_time", "value": -20 }
              ],
              "epilogueTexts": [
                "Ви не зловили мандаринку, але зловили натхнення і написали поему про трагедію цитрусових галюцинацій.",
                "Ремонт ноутбука коштував вам дорожче, ніж річний запас мандаринів.",
                "Цей випадок став повчальною історією про важливість правильного харчування під час дедлайнів.",
                "Ви довели, що погоня за мрією (навіть фантомною) може призвести до руйнувань.",
                "Ви так і не знайшли батарейку від мишки. Вона досі десь під диваном."
              ]
            }
          },
          {
            "buttonText": "Стримувати бажання",
            "outcome": {
              "duration": 7000,
              "video": "event6_2.mp4",
              "sound": "event6_2.mp3",
              "effects": [
                { "type": "modify_time", "value": -5 },
                { "type": "modify_progress_rate", "value": 0.5, "duration": 20000 }
              ],
              "epilogueTexts": [
                "Ви зрозуміли, що мандаринки з'їли ваші сусіди по гуртожитку. Помста була солодкою. Як апельсин.",
                "Ця подія надихнула вас на створення дієти, заснованої виключно на мандаринових шкірках.",
                "Ваша сила волі вразила богів Олімпу, і вони дарували вам здатність викликати мандарини силою думки.",
                "Ви так і не з'їли мандаринку, але ваша жага до неї перетворилася на жагу до знань.",
                "Наступного дня ви купили 10 кг мандаринів і з'їли їх за один раз. Ви більше ніколи не хотіли мандаринів."
              ]
            }
          }
        ]
      },
      {
        "id": "event_github_temptation",
        "type": "choice",
        "weight": 7,
        "mainVideo": "event7_main.mp4",
        "title": "Спокуса з Гітхабу",
        "shortDescription": "Ви знайшли готове рішення вашого однокурсника. Скопіювати чи ні - ось у чому питання.",
        "fullDescription": "Денис перевіряє гітхаб на екрані ноутбука та бачить акаунт свого однокурсника, що вже має репозиторій з виконаним завданням. Спокуса наповнює його: “Може мені надихнутись?”. Він перевіряє цей гітхаб репозиторій та розуміє що все там виконано: “Але ж мені впаяють антиплагіат! Мені поставлять нуль! Але може і не поставлять…”.",
        "choices": [
          {
            "buttonText": "Надихнутися",
            "outcome": {
              "duration": 6000,
              "video": "event7_1.mp4",
              "sound": "event7_1.mp3",
              "effects": [
                { "type": "modify_time", "value": -15 },
                { "type": "modify_progress", "value": 25 }
              ],
              "epilogueTexts": [
                "Викладач не помітив плагіату. Ви відчули себе геніальним злочинцем.",
                "Викладач помітив плагіат. Вас відрахували. Але ви не шкодуєте.",
                "Ви так добре змінили код, що однокурсника звинуватили в плагіаті у вас.",
                "Цей досвід навчив вас, що іноді мета виправдовує засоби.",
                "Ви отримали високу оцінку, але до кінця життя вас мучило сумління. Жартую, не мучило."
              ]
            }
          },
          {
            "buttonText": "Дослідити",
            "outcome": {
              "duration": 4000,
              "video": "event7_2.mp4",
              "sound": "event7_2.mp3",
              "effects": [
                { "type": "modify_time", "value": -10 },
                { "type": "modify_progress_rate", "value": 2, "duration": 10000 }
              ],
              "epilogueTexts": [
                "Дослідивши код, ви знайшли в ньому помилку і повідомили про неї однокурснику. Він був вам вдячний.",
                "Ви зрозуміли принцип роботи і написали код ще краще, ніж у нього. Ваша самооцінка злетіла.",
                "Чесність була винагороджена: викладач оцінив ваш унікальний підхід.",
                "Ви витратили трохи більше часу, але отримали безцінні знання.",
                "Ви зрозуміли, що чужий код - як чужа душа: темний ліс."
              ]
            }
          }
        ]
      },
      {
        "id": "event_toilet_emergency",
        "type": "qte",
        "weight": 6,
        "mainVideo": "event8_main.mp4",
        "loopVideo": "event8_loop.mp4",
        "title": "Екстрена тривога!",
        "shortDescription": "Природа кличе, і вона не буде чекати. А потім у гру вступає телефон...",
        "fullDescription": "Денис сидить та кодить свій застосунок, як у нього починає гучно бурлити живіт так, ніби він стримує Ніагарський водопад у собі. Живіт так скручує, що хлопець стискується та прижимає руки до живота. “Екстрена тривога!!” - кричить він та біжить до туалету. Він сідає і з нього виходить вся нечисть. Потім він змиває унітаз і розуміє, що в унітаз впав телефон і треба діяти швидко.",
        "qteSettings": {
          "duration": 10000,
          "clicksToWin": 45
        },
        "successOutcome": {
          "duration": 5000,
          "video": "event8_success.mp4",
          "sound": "event8_success.mp3",
          "effects": [],
          "epilogueTexts": [
            "Ви врятували телефон, але тепер він пахне лавандовим освіжувачем повітря.",
            "Цей випадок навчив вас більше ніколи не брати телефон до туалету.",
            "Ви продали цей телефон на OLX з позначкою 'не битий, не фарбований, трохи втоплений'.",
            "Ваша реакція була настільки швидкою, що ви задумалися про кар'єру ніндзя.",
            "Телефон вижив, але ваш акаунт в Clash Royale все одно забанили."
              ]
        },
        "failureOutcome": {
          "duration": 7000,
          "video": "event8_failure.mp4",
          "sound": "event8_failure.mp3",
          "effects": [
            { "type": "modify_time", "value": -5 },
            { "type": "modify_progress_rate", "value": 0.5, "duration": 10000 }
          ],
          "epilogueTexts": [
            "Ви втратили телефон, але знайшли внутрішній спокій і стали менше залежати від соцмереж.",
            "Ви влаштували телефону пишний похорон в унітазі.",
            "Наступного дня ви купили старий кнопковий телефон і відчули себе хіпстером.",
            "Сантехнік, якого ви викликали, знайшов ваш телефон. Він попросив за нього викуп.",
            "Ви зрозуміли, що матеріальні речі - це ніщо. І продовжили плакати."
          ]
        }
      },
      {
        "id": "event_power_outage",
        "type": "choice",
        "weight": 5,
        "mainVideo": "event9_main.mp4",
        "title": "(не)Планове відключення світла",
        "shortDescription": "Темрява... Тиша... І лише думка про незбережений промпт для ChatGPT.",
        "fullDescription": "Денис пише запит до чатагпт, написав уже великий промпт, а тут раптом виключається світло. Він згадує, що забувся про ці графіки і видає розлючені звуки.",
        "choices": [
          {
            "buttonText": "Роздати мобільний інтернет",
            "outcome": {
              "duration": 6000,
              "video": "event9_1.mp4",
              "sound": "event9_1.mp3",
              "effects": [
                { "type": "modify_time", "value": -5 }
              ],
              "epilogueTexts": [
                "Ви успішно роздали інтернет, але ваш мобільний трафік закінчився через 5 хвилин.",
                "Поки ви шукали телефон, світло ввімкнули. Ви відчули себе переможцем по життю.",
                "Ви навчилися знаходити телефон в темряві на дотик. Це корисна навичка.",
                "Крихти сухариків на телефоні додали вашому життю пікантності.",
                "Ви продовжили роботу, довівши, що справжнього кодера не зупинить навіть темрява."
              ]
            }
          },
          {
            "buttonText": "Включити генератор",
            "outcome": {
              "duration": 8000,
              "video": "event9_2.mp4",
              "sound": "event9_2.mp3",
              "effects": [
                { "type": "modify_time", "value": -10 }
              ],
              "epilogueTexts": [
                "Ви посварилися з бабцею, але забезпечили світлом не тільки себе, а й весь під'їзд.",
                "Коробка від генератора стала місцевою пам'яткою.",
                "Ви зрозуміли, що звук генератора - найкраща музика для кодингу.",
                "Бабця так і не дізналася, хто кинув коробку. Ваша конспірація була бездоганною.",
                "Ви отримали прізвисько 'Володар Генератора'."
              ]
            }
          }
        ]
      }
    ]
  }